<template>
  <header class="header">
    <div class="header__container">
      <a href="/" class="header__logo">
        <img
          class="header__image"
          src="../../../static/img/homepage/logo.svg"
          alt="логотип_компании"
        />
      </a>
      <ul class="header__contacts list">
        <li class="header__contacts-link-container list-item">
          <a href="mailto:info@avaks.org" class="header__contacts-link"
            >info@avaks.org</a
          >
        </li>
      </ul>
    </div>
  </header>
  <article class="privacy-policy__text-container">
    <h1 class="privacy-policy__title">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>
    <p class="privacy-policy__description">
      Настоящая Политика конфиденциальности персональных данных (далее –
      Политика конфиденциальности) действует в отношении всей информации,
      которую компания AVAKS (далее Компания) может получить о Пользователе во
      время использования сайта avaks.org (далее Сайт).
    </p>
    <p class="privacy-policy__subtitle">1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        1.1. В Политике конфиденциальности используются следующие термины:
      </li>
      <li class="privacy-policy__list-item">
        1.1.1. Персональные данные - любая информация, относящаяся прямо или
        косвенно к определенному, или определяемому физическому лицу (субъекту
        персональных данных).
      </li>
      <li class="privacy-policy__list-item">
        1.1.2. Информация – сведения (сообщения, данные) независимо от формы их
        представления.
      </li>
      <li class="privacy-policy__list-item">
        1.1.3. Оператор – государственный орган, муниципальный орган,
        юридическое или физическое лицо, самостоятельно или совместно с другими
        лицами организующие и (или) осуществляющие обработку персональных
        данных, а также определяющие цели обработки персональных данных, состав
        персональных данных, подлежащих обработке, действия (операции),
        совершаемые с персональными данными.
      </li>
      <li class="privacy-policy__list-item">
        1.1.4. Обработка персональных данных – любое действие (операция) или
        совокупность действий (операций), совершаемых с использованием средств
        автоматизации или без использования таких средств с персональными
        данными, включая сбор, запись, систематизацию, накопление, хранение,
        уточнение (обновление, изменение), извлечение, использование, передачу
        (распространение, предоставление, доступ), обезличивание, блокирование,
        удаление, уничтожение персональных данных.
      </li>
      <li class="privacy-policy__list-item">
        1.1.5. Автоматизированная обработка персональных данных – обработка
        персональных данных с помощью средств вычислительной техники.
      </li>
      <li class="privacy-policy__list-item">
        1.1.6. Предоставление персональных данных – действия, направленные на
        раскрытие персональных данных определенному лицу или определенному кругу
        лиц.
      </li>
      <li class="privacy-policy__list-item">
        1.1.7. Распространение персональных данных – действия, направленные на
        раскрытие персональных данных неопределенному кругу лиц.
      </li>
      <li class="privacy-policy__list-item">
        1.1.8. Блокирование персональных данных – временное прекращение
        обработки персональных данных (за исключением случаев, когда обработка
        необходима для уточнения персональных данных).
      </li>
      <li class="privacy-policy__list-item">
        1.1.9. Уничтожение персональных данных – действия, в результате которых
        становится невозможным восстановить содержание персональных данных в
        информационной системе персональных данных и (или) в результате которых
        уничтожаются материальные носители персональных данных.
      </li>
      <li class="privacy-policy__list-item">
        1.1.10. Обезличивание персональных данных – действия, в результате
        которых становится невозможным без использования дополнительной
        информации определить принадлежность персональных данных конкретному
        субъекту персональных данных.
      </li>
      <li class="privacy-policy__list-item">
        1.1.11. Информационная система персональных данных – совокупность
        содержащихся в базах данных персональных данных и обеспечивающих их
        обработку информационных технологии и технических средств.
      </li>
      <li class="privacy-policy__list-item">
        1.1.12. Пользователь сайта (далее Пользователь) – лицо, имеющее доступ к
        Сайту, посредством сети Интернет и использующее Сайт.
      </li>
      <li class="privacy-policy__list-item">
        1.1.13. Cookies — небольшой фрагмент данных, отправленный веб-сервером и
        хранимый на компьютере пользователя, который веб-клиент или веб-браузер
        каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть
        страницу соответствующего сайта.
      </li>
      <li class="privacy-policy__list-item">
        1.1.14. IP-адрес — уникальный сетевой адрес узла в компьютерной сети,
        построенной на основе стека протоколов TCP/IP.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">2. ОБЩИЕ ПОЛОЖЕНИЯ</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        2.1. Использование Пользователем Сайта означает согласие с настоящей
        Политикой конфиденциальности и условиями обработки персональных данных
        Пользователя.
      </li>
      <li class="privacy-policy__list-item">
        2.2. В случае несогласия с условиями Политики конфиденциальности
        Пользователь должен прекратить использование Сайта.
      </li>
      <li class="privacy-policy__list-item">
        2.3. Настоящая Политика конфиденциальности применяется только к Сайту.
        Сайт не контролирует и не несет ответственность за сайты третьих лиц, на
        которые Пользователь может перейти по ссылкам, доступным на Сайте.
      </li>
      <li class="privacy-policy__list-item">
        2.4. Пользователь предоставляет свои данные добровольно. Компания не
        проверяет достоверность персональных данных, предоставляемых
        Пользователем. Пользователь может использовать Сайт без указания
        каких-либо персональных данных, то есть возможен анонимный просмотр.
      </li>
      <li class="privacy-policy__list-item">
        2.5. Предоставляя свои персональные данные (путем размещения заявки на
        Сайте, регистрации на Сайте или иным законным способом), Пользователь
        добровольно дает свое добровольное согласие на их обработку.
      </li>
      <li class="privacy-policy__list-item">
        2.6. Предоставляя свои персональные данные (путем размещения заявки на
        Сайте, регистрации на Сайте или иным законным способом), Пользователь
        соглашается получать от Компании на электронную почту и мобильный
        телефон информационные, в том числе рекламные сообщения, а также
        сервисные сообщения, информирующие о заказе и этапах его обработки и
        исполнения.
      </li>
      <li class="privacy-policy__list-item">
        2.7. Предоставляя свои персональные данные (путем регистрации на Сайте
        или иным законным способом), Пользователь соглашается получать
        электронные рассылки новостей, информацию о продуктах и услугах,
        специальных предложениях и акциях Компании, индивидуальные ответы на
        обращения по вопросам исполнения заказов/договоров, пользования
        сервисом.
      </li>
      <li class="privacy-policy__list-item">
        2.8. Пользователь вправе в любой момент отписаться от получения
        электронной рассылки самостоятельно, нажав на соответствующую ссылку,
        расположенную внизу каждого письма электронной рассылки. Пользователь
        также может отписаться от рассылки, отправив письмо с данным требованием
        в произвольнои форме на e-mail: info@avaks.org
      </li>
    </ul>
    <p class="privacy-policy__subtitle">
      3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ
    </p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        3.1. Сайт собирает и хранит только те персональные данные, которые
        необходимы для предоставления сервисов или исполнения соглашении и
        договоров с Пользователем, за исключением случаев, когда
        законодательством РФ предусмотрено обязательное хранение персональных
        данных в течение определенного законом срока.
      </li>
      <li class="privacy-policy__list-item">
        3.2. В Компании обрабатываются следующие персональные данные:
      </li>
      <li class="privacy-policy__list-item">
        3.2.1. Персональные данные, которые Пользователь предоставляет о себе
        самостоятельно при регистрации (создании учетной записи) или в процессе
        использования сайта, а именно:
        <p>фамилия, имя, отчество;</p>
        <p>контактный телефон;</p>
        <p>адрес электронной почты (e-mail);</p>
        <p>другие личные данные Пользователя</p>
      </li>
      <li class="privacy-policy__list-item">
        3.2.2. Данные, которые автоматически передаются сервисам Сайта в
        процессе их использования с помощью установленного на устройстве
        Пользователя программного обеспечения, в том числе:
        <p>IP адрес;</p>
        <p>информация из cookies;</p>
        <p>информация о браузере;</p>
        <p>время доступа;</p>
        <p>
          технические характеристики оборудования и программного обеспечения,
          используемых Пользователем;
        </p>
        <p>
          сведения о просмотре рекламных баннеров; дата и время доступа к
          сервисам;
        </p>
        <p>адреса запрашиваемых страниц;</p>
        <p>иная подобная информация.</p>
        <p>
          Отключение cookies может повлечь невозможность доступа к некоторым
          страницам Сайта.
        </p>
      </li>
      <li class="privacy-policy__list-item">
        3.3. Любая иная персональная информация, неоговоренная выше (например,
        история покупок или сообщений, переданных посредством
        онлайн-мессенджеров, установленных на сайте, либо онлайн-форм), подлежит
        надежному хранению и нераспространению, за исключением случаев,
        предусмотренных в п.п. 6.4. и 6.5. настоящей Политики
        конфиденциальности.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">
      4. ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
    </p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        Компания гарантирует, что персональные данные, полученные от
        Пользователей, обрабатываются в соответствии и в целях соблюдения
        Конституции Российской Федерации, Федерального закона «О персональных
        данных» N 152-ФЗ от 27.07.2006 года, Постановления Правительства РФ N
        687 от 15.09.2008 года, Постановления Правительства РФ N 1119 от
        01.11.2012 года и других нормативно-правовых актов; с использованием
        всех необходимых организационно-технических мер по обеспечению
        безопасности персональных данных в пределах компетенции Компании, во
        избежание любых изменений, утраты, незаконного использования и
        несанкционированного доступа.
      </li>
      <li class="privacy-policy__list-item">
        При обработке персональных данных соблюдаются следующие принципы:
        <p>
          обработка персональных данных осуществляется на законной и
          справедливой основе;
        </p>
        <p>
          персональные данные не раскрываются третьим лицам и не
          распространяются без согласия Клиента, за исключением случаев,
          предусмотренных настоящей Политикой конфиденциальности, а также
          случаев, требующих раскрытия персональных данных по запросу
          уполномоченных государственных органов, судопроизводства;
        </p>
        <p>
          определение конкретных законных целей до начала обработки (в т.ч.
          сбора) персональных данных;
        </p>
        <p>
          ведется сбор только тех персональных данных, которые являются
          необходимыми и достаточными для заявленной цели обработки;
        </p>
        <p>
          объединение баз данных, содержащих персональные данные, обработка
          которых осуществляется в целях, несовместимых между собой не
          допускается;
        </p>
        <p>
          обработка персональных данных ограничивается достижением конкретных,
          заранее определенных и законных целей.
        </p>
      </li>
    </ul>
    <p class="privacy-policy__subtitle">
      5. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ
    </p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        5.1. Персональные данные Пользователя могут использоваться в целях:
      </li>
      <li class="privacy-policy__list-item">
        5.1.1. Установления с Пользователем обратной связи, включая направление
        уведомлений, запросов, касающихся использования Сайта, оказания услуг,
        обработка запросов, заказов и заявок от Пользователя.
      </li>
      <li class="privacy-policy__list-item">
        5.1.2. Создания учетной записи для совершения покупок, если Пользователь
        дал согласие на создание учетной записи.
      </li>
      <li class="privacy-policy__list-item">
        5.1.3. Идентификации Пользователя, зарегистрированного на Сайте, для
        оформления заказа и (или) заключения Договора купли-продажи
        продукции/выполнения работ/оказания услуг.
      </li>
      <li class="privacy-policy__list-item">
        5.1.4. Предоставления Пользователю доступа к персонализированным
        ресурсам Сайта.
      </li>
      <li class="privacy-policy__list-item">
        5.1.5. Анализа данных и проведения различных исследований.
      </li>
      <li class="privacy-policy__list-item">
        5.1.6. Таргетирования рекламных материалов.
      </li>
      <li class="privacy-policy__list-item">
        5.1.7. Предоставления Пользователю с его согласия, информации об
        обновлениях продукции, специальных предложениях, информации о ценах,
        новостной рассылки и иных сведении о Компании.
      </li>
      <li class="privacy-policy__list-item">
        5.1.8. Осуществления рекламной деятельности с согласия Пользователя, в
        том числе информирования об акциях, скидках и специальных предложениях.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">
      6. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
    </p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        6.1. Компания осуществляет сбор, запись, систематизацию, накопление,
        хранение, уточнение (обновление, изменение), извлечение, использование,
        передачу (распространение, предоставление, доступ), обезличивание,
        блокирование, удаление и уничтожение персональных данных.
      </li>
      <li class="privacy-policy__list-item">
        6.2. Обработка персональных данных Пользователя осуществляется без
        ограничения срока.
      </li>
      <li class="privacy-policy__list-item">
        6.3. Обработка персональных данных осуществляется следующими способами:
        <p>неавтоматизированная обработка персональных данных;</p>
        <p>
          автоматизированная обработка персональных данных с передачей
          полученной информации по информационно-телекоммуникационным сетям или
          без таковой;
        </p>
        <p>смешанная обработка персональных данных.</p>
      </li>
      <li class="privacy-policy__list-item">
        6.4. Предоставляя свои персональные данные (путем размещения
        заявки/регистрации на Сайте или иным законным способом), Пользователь
        соглашается с тем, что Компания вправе осуществлять предоставление его
        персональных данных третьим лицам, в частности:
        <p>курьерским службам,</p>
        <p>организациями почтовой связи,</p>
        <p>юридическим лицам, входящим в Группу Компаний AVAKS,</p>
        <p>
          исключительно в целях выполнения заказа Пользователя, оформленного на
          Сайте, включая исполнение заявки/заказа/запроса, доставку продукции,
          выполнение работ, оказание услуг.
        </p>
      </li>
      <li class="privacy-policy__list-item">
        6.5. Персональные данные Пользователя могут быть переданы уполномоченным
        органам государственной власти Россиийской Федерации только по
        основаниям и в порядке, установленным законодательством Россиийской
        Федерации.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">7. ОБЯЗАТЕЛЬСТВА СТОРОН</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">7.1. Пользователь обязан:</li>
      <li class="privacy-policy__list-item">
        7.1.1. Предоставить информацию о персональных данных, необходимую для
        пользования Сайтом.
      </li>
      <li class="privacy-policy__list-item">
        7.1.2. При необходимости своевременно обновлять, дополнять
        предоставленную информацию о персональных данных в случае изменения
        данной информации.
      </li>
      <li class="privacy-policy__list-item">7.2. Компания обязана:</li>
      <li class="privacy-policy__list-item">
        7.2.1. Использовать полученную информацию исключительно для целей,
        указанных в разделе 5 настоящей Политики конфиденциальности.
      </li>
      <li class="privacy-policy__list-item">
        7.2.2. Принимать необходимые организационные и технические меры для
        защиты персональных данных Пользователя от неправомерного или случаи
        иного доступа к ним, уничтожения, изменения, блокирования, копирования,
        предоставления (за исключением случаев, предусмотренных п.п. 6.4. и 6.5.
        настоящей Политики конфиденциальности), распространения, а также от иных
        неправомерных действий в отношении персональных данных. Компания вправе
        поручить обработку персональных данных Пользователей третьим лицам, на
        основании заключаемого с этими лицами договора, условиями которого будет
        обязательство соблюдать принципы и правила обработки и защиты
        персональных данных, предусмотренные Федеральным законом № 152-ФЗ «О
        персональных данных».
      </li>
      <li class="privacy-policy__list-item">
        7.2.3. Осуществить блокирование персональных данных, относящихся к
        соответствующему Пользователю, с момента обращения или запроса
        Пользователя, или его законного представителя либо уполномоченного
        органа по защите прав субъектов персональных данных на период проверки,
        в случае выявления недостоверных персональных данных или неправомерных
        действий.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">8. ОТВЕТСТВЕННОСТЬ</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        8.1. За неисполнение/ненадлежащее исполнение настоящей Политики
        конфиденциальности Компания несет ответственность, предусмотренную
        действующим законодательством РФ.
      </li>
      <li class="privacy-policy__list-item">
        8.2. Пользователь несет ответственность за достоверность сведений,
        указанных им при размещении заявки/регистрации на Сайте.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">9. КАК СВЯЗАТЬСЯ С КОМПАНИЕЙ</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        9.1. Клиент может обратиться в Компанию с запросом, касающимся обработки
        его персональных данных, направив письмо с темой «Запрос о персональных
        данных» (либо «Отзыв согласия на обработку персональных данных» в случае
        отзыва согласия на обработку персональных данных) на адрес электронной
        почты: info@avaks.org или на адрес: г. Москва, г.Москва, Павелецкая
        набережная, 2с2.
        <p>
          В случае направления официального запроса в Компанию в тексте запроса
          необходимо указать:
        </p>
        <p>фамилию, имя, отчество Клиента или его представителя;</p>
        <p>
          номер основного документа, удостоверяющего личность Клиента или его
          представителя, сведения о дате выдачи указанного документа и выдавшем
          его органе;
        </p>
        <p>сведения, подтверждающие наличие у Клиента отношений с Компанией;</p>
        <p>
          информацию для обратной связи с целью направления Компанией ответа на
          запрос.
        </p>
      </li>
    </ul>
    <p class="privacy-policy__subtitle">10. РАЗРЕШЕНИЕ СПОРОВ</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        10.1. До обращения в суд с иском по спорам, возникающим из отношении
        между Пользователем Сайта и Компанией, обязательным является
        предъявление претензии (письменного предложения о добровольном
        урегулировании спора).
      </li>
      <li class="privacy-policy__list-item">
        10.2. Получатель претензии в течение 30 календарных дней со дня
        получения претензии уведомляет заявителя претензии о результатах ее
        рассмотрения.
      </li>
      <li class="privacy-policy__list-item">
        10.3. При не достижении соглашения спор может быть передан на
        рассмотрение в суд в соответствии с действующим законодательством
        Российской Федерации.
      </li>
      <li class="privacy-policy__list-item">
        10.4. К настоящей Политике конфиденциальности и отношениям между
        Пользователем и Компанией применяется действующее законодательство
        Российской Федерации.
      </li>
    </ul>
    <p class="privacy-policy__subtitle">11. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</p>
    <ul class="privacy-policy__list">
      <li class="privacy-policy__list-item">
        11.1. Политика конфиденциальности является общедоступной и подлежит
        размещению на Сайте.
      </li>
      <li class="privacy-policy__list-item">
        11.2. Компания вправе вносить изменения в настоящую Политику
        конфиденциальности без согласия Пользователя.
      </li>
      <li class="privacy-policy__list-item">
        11.3. Новая Политика конфиденциальности вступает в силу с момента ее
        размещения на Сайте, если иное не предусмотрено новой редакцией Политики
        конфиденциальности.
      </li>
    </ul>
  </article>
</template>
<script setup lang="ts"></script>

<style scoped>
.hidden {
  display: none !important;
}
.header {
  width: 100%;
  border-bottom: 1px solid rgba(255, 255, 255, 0.15);
  background-color: #000c2a;
}
.header__container {
  display: flex;
  flex-direction: row;
  align-items: center;
  justify-content: space-between;
  gap: 40px;
  padding: 25px 160px;
}
.privacy-policy__title {
  font-size: 38px;
  font-weight: 700;
  line-height: 38px;
  text-align: center;
  padding-bottom: 30px;
}
.privacy-policy__description {
  font-size: 16px;
  font-weight: 500;
  line-height: 130%;
  padding-bottom: 30px;
}
.privacy-policy__subtitle {
  font-size: 16px;
  font-weight: 500;
  line-height: 120%;
}
.privacy-policy__list {
  display: flex;
  flex-direction: column;
  gap: 10px;
  font-size: 16px;
  font-weight: 500;
  line-height: 140%;
  list-style: none;
  margin: 0;
  padding: 0 0 0 20px;
}
.privacy-policy__list-item {
  list-style: none;
  margin: 0;
}
.header__contacts {
  padding: 0;
}
.header__contacts:hover {
  opacity: 0.7;
}
.header__contacts-link {
  color: white;
  text-decoration: none;
  color: #fff;
  font-family: Montserrat;
  font-size: 15px;
  font-style: normal;
  font-weight: 600;
  line-height: normal;
}
.header__logo {
  cursor: pointer;
}
.header__logo:hover {
  opacity: 0.7;
}
.privacy-policy__text-container {
  background-color: #000c2a;
  color: white;
  padding: 60px 160px 0;
  display: flex;
  flex-direction: column;
  gap: 40px;
}

@media (min-width: 675px) and (max-width: 1439px) {
  .header__container {
    gap: 20px;
    padding: 25px 60px;
  }
  .privacy-policy__text-container {
    padding: 60px 60px 0;
  }
}

@media (min-width: 320px) and (max-width: 674px) {
  .header__container {
    gap: 20px;
    padding: 25px 20px;
  }
  .privacy-policy__text-container {
    padding: 60px 20px 0;
    gap: 30px;
  }
  .privacy-policy__title {
    font-size: 20px;
    padding: 0;
  }
  .privacy-policy__description {
    padding: 0;
  }
}
</style>
